Revit 2027 API
AnalyticalStructuralRole Enumeration
 Indicates the structural role for the analytical elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalyticalStructuralRole
Public Enumeration AnalyticalStructuralRole
public enum class AnalyticalStructuralRole
type AnalyticalStructuralRole
Members
Member name | Value | Description
StructuralRoleBeam | 0 |  Member plays role of structural beam.
StructuralRoleCladding | 8 |  Member plays role of structural cladding.
StructuralRoleColumn | 1 |  Member plays role of structural column.
StructuralRoleFloor | 5 |  Member plays role of structural floor.
StructuralRoleGirder | 4 |  Member plays role of structural girder.
StructuralRoleMember | 3 |  Member plays role of structural member.
StructuralRolePanel | 7 |  Member plays role of structural panel.
StructuralRoleWall | 6 |  Member plays role of structural wall.
Unset | -1 |  No structural role by default.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace